# Brewfile

## Tap
tap "homebrew/autoupdate"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "oven-sh/bun"
tap "s6n-jp/tap"
tap "sidneys/homebrew"
tap "minacle/chntpw"

## Formula
brew "aria2"
brew "bat"
brew "btop"
brew "bun"
brew "chezmoi"
brew "cloudflared"
brew "eza"
brew "ffmpeg"
brew "fish"
brew "fzf"
brew "fd"
brew "gh"
brew "s6n-jp/tap/ghr"
brew "git"
brew "gnupg"
brew "htop"
brew "lazydocker"
brew "lazygit"
brew "neofetch"
brew "mas"
brew "mise"
brew "minacle/chntpw/chntpw"
brew "pinentry-mac"
brew "pkg-config"
brew "sbt"
brew "starship"
brew "topgrade"
brew "wimlib"
brew "rust-analyzer"

### Deps Formula (DON'T REMOVE!)
brew "coreutils"
brew "tfenv"

## Cask
cask "1password"
cask "1password-cli"
cask "alacritty"
cask "cleanshot"
cask "deepl"
cask "discord-canary"
cask "docker"
cask "figma"
cask "firefox-nightly"
cask "font-noto-sans-jp"
cask "font-jetbrains-mono-nerd-font"
cask "google-japanese-ime"
cask "jetbrains-toolbox"
cask "notion"
cask "notion-calendar"
cask "maccy"
cask "obs"
cask "postman"
cask "prismlauncher"
cask "raycast"
cask "rectangle"
cask "spotify"
cask "slack"
cask "wireshark"
cask "visual-studio-code-insiders"
cask "zulu21"
cask "zulu17"
cask "zulu8"
cask "linear-linear"

## Mas
mas "LINE", id: 539883307
mas "Microsoft Excel", id: 462058435
mas "Microsoft Word", id: 462054704
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Outlook", id: 985367838
mas "Toggl Track", id: 1291898086
mas "Tailscale", id: 1475387142
mas "RunCat", id: 1429033973

cask_args appdir: "~/Applications", require_sha: true
