# tap

tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"

# brew

brew "bat"
brew "cloudflared"
brew "coreutils"
brew "deno"
brew "ffmpeg"
brew "figlet"
brew "gawk"
brew "gh"
brew "ghq"
brew "git"
brew "gnupg"
brew "lazygit"
brew "mas"
brew "neofetch"
brew "nvm"
brew "onefetch"
brew "peco"
brew "pinentry-mac"
brew "sbt"
brew "starship"
brew "tmux"
brew "trivy"
brew "ykman"
brew "yt-dlp"
brew "binutils"
brew "htop"

# cask

cask_args appdir: "~/Applications", require_sha: true

cask "alacritty"
cask "cleanshot"
cask "clipy"
cask "discord"
cask "docker"
cask "google-chrome"
cask "google-japanese-ime"
cask "jetbrains-toolbox"
cask "keybase"
cask "notion"
cask "postman"
cask "raycast"
cask "spotify"
cask "visual-studio-code"
cask "deepl"
# sha256 checksum 未定義
cask "cloudflare-warp"

# mas

mas "1Password for Safari", id: 1569813296
mas "BetterSnapTool", id: 417375580
mas "iMovie", id: 408981434
mas "LINE", id: 539883307
mas "Microsoft Outlook", id: 985367838
mas "NextDNS", id: 1464122853
mas "RunCat", id: 1429033973
mas "TickTick", id: 966085870
mas "Xcode", id: 497799835
