tap "gromgit/fuse"
tap "homebrew/bundle"
tap "homebrew/services"
tap "jdx/tap"
tap "koekeishiya/formulae"
tap "s6n-jp/tap"
tap "sidneys/homebrew"

brew "ca-certificates"
brew "bat"
brew "btop"
brew "chezmoi"
brew "eza"
brew "fd"
brew "fish"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "git"
brew "gnupg"
brew "lazygit"
brew "usage"
brew "mise"
brew "neovim"
brew "nextdns"
brew "pinentry-mac"
brew "ripgrep"
brew "starship"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
brew "s6n-jp/tap/ghr"
brew "yt-dlp"

cask "1password-cli"
cask "1password"
cask "alacritty"
cask "alcom"
cask "cleanshot"
cask "chatgpt"
cask "claude"
cask "deepl"
cask "discord@canary"
# cask "docker"
cask "firefox@nightly"
cask "font-0xproto-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-noto-sans-jp"
cask "google-japanese-ime@dev"
cask "proton-mail"
cask "protonmail-bridge"
cask "jetbrains-toolbox"
cask "notion"
cask "notion-calendar"
cask "unity-hub"
cask "raycast"
cask "spotify"
cask "stellarium"
cask "spacedrive"
cask "keybase"
cask "obsidian"
cask "orbstack"
cask "tailscale"
cask "thunderbird@daily"
cask "zed@preview"
cask "vlc@nightly"
