tap "gromgit/fuse"
tap "koekeishiya/formulae"
tap "nikitabobko/tap"
tap "s6n-jp/tap"

brew "awscli"
brew "bat"
brew "btop"
brew "chezmoi"
brew "colima"
brew "cmake"
brew "docker"
brew "docker-buildx"
brew "docker-compose"
brew "eza"
brew "fastfetch"
brew "ffmpeg"
brew "fish"
brew "fzf"
brew "gh"
brew "git"
brew "gnupg"
brew "lazygit"
brew "lld"
brew "llmfit"
brew "llvm"
brew "mise"
brew "pinentry-mac"
brew "protobuf"
brew "ripgrep"
brew "s6n-jp/tap/ghr"
brew "zoxide"

cask "azookey"
cask "claude"
cask "comet"
cask "claude-code"
cask "copilot-cli"
cask "cleanshot"
cask "discord"
cask "deepl"
cask "firefox@nightly"
cask "font-noto-sans-jp"
cask "font-plemol-jp-nf"
cask "figma"
cask "ghostty"
cask "gitify"
cask "gimp"
cask "jetbrains-toolbox"
cask "kid3"
cask "obsidian"
cask "ollama"
cask "prismlauncher"
cask "proton-mail"
cask "proton-drive"
cask "proton-pass"
cask "protonvpn"
cask "postman"
cask "raycast"
cask "rectangle"
cask "slack"
cask "spotify"
cask "tailscale-app"
cask "vlc"
cask "zed"
