# tap
tap "homebrew/bundle"
tap "s6n-jp/tap"
tap "sidneys/homebrew"
tap "jdx/tap"
tap "gromgit/fuse"
tap "koekeishiya/formulae"

# brew
brew "bat"
brew "btop"
brew "chezmoi"
brew "eza"
brew "fd"
brew "fish"
brew "fzf"
brew "fastfetch"
brew "gh"
brew "git"
brew "gnupg"
brew "gromgit/fuse/sshfs-mac"
brew "lazygit"
brew "neovim"
brew "mise"
brew "pinentry-mac"
brew "ripgrep"
brew "starship"
brew "koekeishiya/formulae/skhd"
brew "jdx/tap/usage"
brew "s6n-jp/tap/ghr"
brew "unar"
brew "koekeishiya/formulae/yabai"

# cask
cask "1password@nightly"
cask "1password-cli"
cask "alacritty"
cask "cleanshot"
cask "chatgpt"
cask "discord@canary"
cask "docker"
cask "deepl"
cask "figma"
cask "firefox@nightly"
cask "font-0xproto-nerd-font"
cask "font-noto-sans-jp"
cask "font-jetbrains-mono-nerd-font"
cask "google-japanese-ime@dev"
cask "google-drive"
# cask "gimp@dev"
cask "jetbrains-toolbox"
cask "notion"
cask "notion-calendar"
cask "obsidian"
cask "prismlauncher"
cask "raycast"
cask "steam"
cask "spotify"
cask "safe-exam-browser"
cask "thunderbird@daily"
cask "telegram"
cask "tailscale"
cask "visual-studio-code@insiders"
cask "utm@beta"
cask "macfuse"

