tap "homebrew/autoupdate"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "heroku/brew"
tap "oven-sh/bun" # "bun" formula tap
brew "bat"
brew "btop" # deps formula
brew "bun"
brew "coreutils" # deps formula
brew "deno"
brew "ffmpeg"
brew "fish"
brew "gawk" # deps formula
brew "gh"
brew "ghq"
brew "git"
brew "gnupg"
brew "htop"
brew "lazydocker"
brew "lazygit"
brew "neofetch"
brew "mas"
brew "nvm"
brew "pinentry-mac"
brew "sbt"
brew "starship"
brew "tfenv" # deps formula
brew "rust-analyzer"
cask "1password"
cask "1password-cli"
cask "alacritty"
cask "arc"
cask "cleanshot"
cask "deepl"
cask "discord"
cask "docker"
cask "figma"
cask "font-jetbrains-mono-nerd-font"
cask "google-japanese-ime"
cask "jetbrains-toolbox"
cask "notion"
cask "obs"
cask "postman"
cask "raycast"
cask "spotify"
cask "stats"
cask "slack"
cask "visual-studio-code"
cask "zulu21"
cask "zulu17"
cask "zulu8"
cask "linear-linear"
mas "BetterSnapTool", id: 417375580
mas "LINE", id: 539883307
mas "NextDNS", id: 1464122853
mas "Toggl Track", id: 1291898086
vscode "codezombiech.gitignore"
vscode "DavidAnson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "denoland.vscode-deno"
vscode "donjayamanne.githistory"
vscode "eamodio.gitlens"
vscode "EditorConfig.EditorConfig"
vscode "esbenp.prettier-vscode"
vscode "GitHub.copilot"
vscode "GitHub.copilot-chat"
vscode "GitHub.remotehub"
vscode "github.vscode-github-actions"
vscode "GitHub.vscode-pull-request-github"
vscode "hashicorp.terraform"
vscode "mhutchie.git-graph"
vscode "mosapride.zenkaku"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.remote-repositories"
vscode "ms-azuretools.vscode-docker"
vscode "ms-vscode.makefile-tools"
vscode "ms-vsliveshare.vsliveshare"
vscode "mutantdino.resourcemonitor"
vscode "oderwat.indent-rainbow"
vscode "PKief.material-icon-theme"
vscode "ritwickdey.LiveServer"
vscode "rust-lang.rust-analyzer"
vscode "shardulm94.trailing-spaces"
vscode "streetsidesoftware.code-spell-checker"
vscode "tamasfe.even-better-toml"
vscode "teabyii.ayu"
vscode "unifiedjs.vscode-mdx"
vscode "usernamehw.errorlens"
vscode "vscjava.vscode-java-pack"
vscode "WakaTime.vscode-wakatime"
vscode "wayou.vscode-todo-highlight"
vscode "yzhang.markdown-all-in-one"

cask_args appdir: "~/Applications", require_sha: true
