tap "heroku/brew"
tap "homebrew/autoupdate"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
brew "bat"
brew "binutils"
brew "cloudflared"
brew "coreutils"
brew "deno"
brew "ffmpeg"
brew "fish"
brew "fzf"
brew "gawk"
brew "gh"
brew "ghq"
brew "git"
brew "gnupg"
brew "htop"
brew "lazydocker"
brew "lazygit"
brew "neovim"
brew "neofetch"
brew "mas"
brew "nvm"
brew "peco"
brew "pinentry-mac"
brew "pkg-config"
brew "sbt"
brew "starship"
brew "terminal-notifier"
brew "tmux"
brew "tfenv"
brew "rust-analyzer"
cask "alacritty"
cask "arc"
cask "cleanshot"
cask "cron"
cask "deepl"
cask "discord"
cask "docker"
cask "font-jetbrains-mono-nerd-font"
cask "google-japanese-ime"
cask "jetbrains-toolbox"
cask "keybase"
cask "notion"
cask "obs"
cask "postman"
cask "raycast"
cask "spotify"
cask "stats"
cask "slack"
cask "visual-studio-code"
cask "zulu17"
cask "zulu8"
mas "BetterSnapTool", id: 417375580
mas "LINE", id: 539883307
mas "Microsoft Excel", id: 462058435
mas "Microsoft OneNote", id: 784801555
mas "Microsoft Outlook", id: 985367838
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Word", id: 462054704
mas "NextDNS", id: 1464122853
mas "Toggl Track", id: 1291898086
vscode "Avetis.tokyo-night"
vscode "codezombiech.gitignore"
vscode "DavidAnson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "denoland.vscode-deno"
vscode "donjayamanne.githistory"
vscode "eamodio.gitlens"
vscode "EditorConfig.EditorConfig"
vscode "esbenp.prettier-vscode"
vscode "GitHub.copilot"
vscode "GitHub.remotehub"
vscode "github.vscode-github-actions"
vscode "GitHub.vscode-pull-request-github"
vscode "hashicorp.terraform"
vscode "mhutchie.git-graph"
vscode "ms-azuretools.vscode-docker"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-repositories"
vscode "mutantdino.resourcemonitor"
vscode "oderwat.indent-rainbow"
vscode "PKief.material-icon-theme"
vscode "ritwickdey.LiveServer"
vscode "rust-lang.rust-analyzer"
vscode "shardulm94.trailing-spaces"
vscode "streetsidesoftware.code-spell-checker"
vscode "tamasfe.even-better-toml"
vscode "unifiedjs.vscode-mdx"
vscode "usernamehw.errorlens"
vscode "vscjava.vscode-java-pack"
vscode "WakaTime.vscode-wakatime"
vscode "wayou.vscode-todo-highlight"
vscode "yzhang.markdown-all-in-one"

cask_args appdir: "~/Applications", require_sha: true
