tap "homebrew/autoupdate"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "heroku/brew"
tap "oven-sh/bun" # "bun" formula tap
tap "s6n-jp/tap" # "ghr" formula tap
tap "sidneys/homebrew"
tap "minacle/chntpw"
brew "asdf"
brew "aria2"
brew "bat"
brew "btop" # deps formula
brew "bun"
brew "coreutils" # deps formula
brew "cabextract"
brew "cdrtools"
brew "ffmpeg"
brew "fish"
brew "fzf"
brew "fd"
brew "volta"
brew "gawk" # deps formula
brew "gh"
brew "s6n-jp/tap/ghr"
brew "git"
brew "gnupg"
brew "htop"
brew "lazydocker"
brew "lazygit"
brew "neofetch"
brew "mas"
brew "minacle/chntpw/chntpw"
brew "pinentry-mac"
brew "pkg-config"
brew "sbt"
brew "starship"
brew "tfenv" # deps formula
brew "wimlib"
brew "rust-analyzer"
cask "1password"
cask "1password-cli"
cask "alacritty"
cask "cron"
cask "cleanshot"
cask "deepl"
cask "discord-canary"
cask "docker"
cask "figma"
cask "firefox-nightly"
cask "firefox-developer-edition"
cask "font-noto-sans-jp"
cask "font-jetbrains-mono-nerd-font"
cask "font-0xproto-nerd-font"
cask "google-japanese-ime"
cask "jetbrains-toolbox"
cask "notion"
cask "maccy"
cask "obs"
cask "postman"
cask "prismlauncher"
cask "raycast"
cask "rectangle"
cask "spotify"
cask "slack"
cask "wireshark"
cask "visual-studio-code"
cask "zulu21"
cask "zulu17"
cask "zulu8"
cask "linear-linear"
mas "LINE", id: 539883307
mas "Microsoft Excel", id: 462058435
mas "Microsoft Word", id: 462054704
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Outlook", id: 985367838
mas "Hand Mirror", id: 1502839586
mas "Toggl Track", id: 1291898086
mas "Tailscale", id: 1475387142
mas "Xcode", id: 497799835
mas "RunCat", id: 1429033973

cask_args appdir: "~/Applications", require_sha: true
